In [5]:
import pandas as pd
import numpy as np

In [2]:
ser = pd.Series(range(5), index=list("abcde"))

In [3]:
ser.loc[["a", "c", "e"]]

a    0
c    2
e    4
dtype: int64

In [6]:
df = pd.DataFrame(np.arange(25).reshape(5, 5), index=list("abcde"), columns=list("abcde"))

In [7]:
df.loc[["a", "c", "e"], ["b", "d"]]

    b   d
a   1   3
c  11  13
e  21  23

In [8]:
dates = pd.date_range('1/1/2000', periods=8)

In [10]:
df = pd.DataFrame(np.random.randn(8, 4),
                  index=dates, columns=['A', 'B', 'C', 'D'])

In [11]:
df

                   A         B         C         D
2000-01-01 -0.972255  0.926885 -0.549505 -2.560553
2000-01-02 -0.380061 -1.002018 -0.756825  0.083045
2000-01-03 -0.723658  0.593036  0.841729  0.413948
2000-01-04 -1.020425  1.092623  0.251007  2.504705
2000-01-05  0.152083  0.007160 -1.303735  0.594521
2000-01-06 -0.281466 -0.122697  0.264620  1.500586
2000-01-07  0.520674  1.174118 -0.117460  0.297655
2000-01-08  0.887252  1.406232 -0.402747  0.767351

In [12]:
s = df['A']

In [13]:
s[dates[5]]

np.float64(-0.28146558255745713)

In [14]:
df

                   A         B         C         D
2000-01-01 -0.972255  0.926885 -0.549505 -2.560553
2000-01-02 -0.380061 -1.002018 -0.756825  0.083045
2000-01-03 -0.723658  0.593036  0.841729  0.413948
2000-01-04 -1.020425  1.092623  0.251007  2.504705
2000-01-05  0.152083  0.007160 -1.303735  0.594521
2000-01-06 -0.281466 -0.122697  0.264620  1.500586
2000-01-07  0.520674  1.174118 -0.117460  0.297655
2000-01-08  0.887252  1.406232 -0.402747  0.767351

In [15]:
df[['B', 'A']] = df[['A', 'B']]

In [16]:
df

                   A         B         C         D
2000-01-01  0.926885 -0.972255 -0.549505 -2.560553
2000-01-02 -1.002018 -0.380061 -0.756825  0.083045
2000-01-03  0.593036 -0.723658  0.841729  0.413948
2000-01-04  1.092623 -1.020425  0.251007  2.504705
2000-01-05  0.007160  0.152083 -1.303735  0.594521
2000-01-06 -0.122697 -0.281466  0.264620  1.500586
2000-01-07  1.174118  0.520674 -0.117460  0.297655
2000-01-08  1.406232  0.887252 -0.402747  0.767351

In [17]:
sa = pd.Series([1, 2, 3], index=list('abc'))

In [18]:
dfa = df.copy()

In [19]:
sa.b

np.int64(2)

In [20]:
dfa.A

2000-01-01    0.926885
2000-01-02   -1.002018
2000-01-03    0.593036
2000-01-04    1.092623
2000-01-05    0.007160
2000-01-06   -0.122697
2000-01-07    1.174118
2000-01-08    1.406232
Freq: D, Name: A, dtype: float64

In [21]:
sa.a = 5

In [22]:
sa

a    5
b    2
c    3
dtype: int64

In [23]:
dfa.A = list(range(len(dfa.index)))  # ok if A already exists

In [24]:
dfa

            A         B         C         D
2000-01-01  0 -0.972255 -0.549505 -2.560553
2000-01-02  1 -0.380061 -0.756825  0.083045
2000-01-03  2 -0.723658  0.841729  0.413948
2000-01-04  3 -1.020425  0.251007  2.504705
2000-01-05  4  0.152083 -1.303735  0.594521
2000-01-06  5 -0.281466  0.264620  1.500586
2000-01-07  6  0.520674 -0.117460  0.297655
2000-01-08  7  0.887252 -0.402747  0.767351

In [25]:
dfa['A'] = list(range(len(dfa.index)))  # use this form to create a new column

In [26]:
dfa

            A         B         C         D
2000-01-01  0 -0.972255 -0.549505 -2.560553
2000-01-02  1 -0.380061 -0.756825  0.083045
2000-01-03  2 -0.723658  0.841729  0.413948
2000-01-04  3 -1.020425  0.251007  2.504705
2000-01-05  4  0.152083 -1.303735  0.594521
2000-01-06  5 -0.281466  0.264620  1.500586
2000-01-07  6  0.520674 -0.117460  0.297655
2000-01-08  7  0.887252 -0.402747  0.767351

In [27]:
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})

In [28]:
x

   x  y
0  1  3
1  2  4
2  3  5

In [29]:
x.iloc[1] = {'x': 9, 'y': 99}

In [30]:
x

   x   y
0  1   3
1  9  99
2  3   5

In [31]:
df_new = pd.DataFrame({'one': [1., 2., 3.]})

In [32]:
df

                   A         B         C         D
2000-01-01  0.926885 -0.972255 -0.549505 -2.560553
2000-01-02 -1.002018 -0.380061 -0.756825  0.083045
2000-01-03  0.593036 -0.723658  0.841729  0.413948
2000-01-04  1.092623 -1.020425  0.251007  2.504705
2000-01-05  0.007160  0.152083 -1.303735  0.594521
2000-01-06 -0.122697 -0.281466  0.264620  1.500586
2000-01-07  1.174118  0.520674 -0.117460  0.297655
2000-01-08  1.406232  0.887252 -0.402747  0.767351

In [33]:
df_new.two = [4, 5, 6]

/var/folders/3l/_1hm2x590s5_n6d4pzvq1v800000gn/T/ipykernel_9792/1574189772.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df_new.two = [4, 5, 6]

In [34]:
df_new

   one
0  1.0
1  2.0
2  3.0

Pandas doesn't allow the users to add columns like that (lame lol)!